app/views/portfolios/index.html.erb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."stock_symbol" = $1 LIMIT $2  [["stock_symbol", "ABBV"], ["LIMIT", 1]]
---
                    <p>
                        <%= Stock.find_by(stock_symbol: stock.stock_symbol)%>