app/views/portfolios/show.html.erb

        <p>
            <%= Stock.find_by(stock_symbol: @portfolio.stock_symbol).comp_name%>
---
SELECT "stocks".* FROM "stocks" WHERE "stocks"."stock_symbol" = $1 LIMIT $2  [["stock_symbol", "ABBV"], ["LIMIT", 1]]