app/views/users/_user.html.erb

            <span class='bg-dark rounded-pill position-absolute top-1 end-0 mx-3'>
                <%= user.portfolios.count %> stocks
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 29]]
SELECT COUNT(*) FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 29]]

                <%= link_to  transaction_path(user) do%>
                    <%= user.transactions.count %>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY "transactions"."id" DESC LIMIT $2  [["user_id", 29], ["LIMIT", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."user_id" = $1  [["user_id", 29]]

                <p class="ms-2">
                    <% if user.transactions.last %>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY "transactions"."id" DESC LIMIT $2  [["user_id", 29], ["LIMIT", 1]]

                        <% end %>
                        <%= user.transactions.last.created_at.strftime("%A %B %d, %Y") %>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY "transactions"."id" DESC LIMIT $2  [["user_id", 30], ["LIMIT", 1]]

                    <div class = "row overflow-auto" style="min-height: 10rem; max-height: 15rem;">
                    <%if user.portfolios.empty?%>
---
SELECT 1 AS one FROM "portfolios" WHERE "portfolios"."user_id" = $1 LIMIT $2  [["user_id", 29], ["LIMIT", 1]]

                    <%else%>
                        <% user.portfolios.each do |stock| %>
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 29]]