app/views/users/index.html.erb

SELECT COUNT(*) FROM "portfolios" WHERE "portfolios"."user_id" = $1  [["user_id", 29]]
---
          <span class="ms-2 col text-center btn btn-dark border rounded-pill">
             <%= trader.portfolios.count %> stocks