app/controllers/balance_controller.rb

UPDATE "users" SET "updated_at" = $1, "balance" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-07 13:44:02.438359"], ["balance", "50.0"], ["id", 18]]
---
  def confirm_deposit
    @user.balance += balance_params[:balance].to_d

    if @user.save!