app/controllers/declined_requests_controller.rb

    def index
        @request =  User.where(role: "trader", state: "Declined").where.not(confirmed_at: nil).order(confirmed_at: :DESC)
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1 AND "users"."state" = $2 AND "users"."confirmed_at" IS NOT NULL ORDER BY "users"."confirmed_at" DESC  [["role", "trader"], ["state", "Declined"]]