app/controllers/pending_requests_controller.rb

    def index
        @request =  User.where(role: "trader", state: "Pending").where.not(confirmed_at: nil).order(:confirmed_at)
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1 AND "users"."state" = $2 AND "users"."confirmed_at" IS NOT NULL ORDER BY "users"."confirmed_at" ASC  [["role", "trader"], ["state", "Pending"]]