app/controllers/portfolios_controller.rb

    def show
      @portfolio = current_user.portfolios.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."id" = $2 LIMIT $3  [["user_id", 30], ["id", 3], ["LIMIT", 1]]

    def buy
      stocksymbol = params[:stocksymbol]
      @portfolio = current_user.portfolios.find_or_initialize_by(:stock_symbol => stocksymbol) do |p|
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."stock_symbol" = $2 LIMIT $3  [["user_id", 30], ["stock_symbol", "ABBV"], ["LIMIT", 1]]

    def update
      @portfolio = current_user.portfolios.find_by(:stock_symbol => portfolio_params[:stock_symbol])
      new_quantity = @portfolio.quantity + portfolio_params[:quantity].to_d
      deducted_amount = @portfolio.access_quote.latest_price * portfolio_params[:quantity].to_d

      ActiveRecord::Base.transaction do
        @user.update!(:balance => @user.balance -= deducted_amount)
        @portfolio.update!(:quantity => new_quantity)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."stock_symbol" = $2 LIMIT $3  [["user_id", 30], ["stock_symbol", "ABBV"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "balance" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-09 17:31:11.032989"], ["balance", "998297.5"], ["id", 30]]
UPDATE "portfolios" SET "quantity" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["quantity", "12.0"], ["updated_at", "2022-09-09 17:31:11.045899"], ["id", 3]]

    def create
      @portfolio = current_user.portfolios.build(portfolio_params)
      deducted_amount = @portfolio.access_quote.latest_price * portfolio_params[:quantity].to_d

      ActiveRecord::Base.transaction do
        @portfolio.save
        @user.update!(:balance => @user.balance -= deducted_amount)
---
INSERT INTO "portfolios" ("stock_symbol", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stock_symbol", "ABBV"], ["quantity", "8.01"], ["created_at", "2022-09-09 17:26:51.973260"], ["updated_at", "2022-09-09 17:26:51.973260"], ["user_id", 30]]
UPDATE "users" SET "updated_at" = $1, "balance" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-09 17:27:48.447827"], ["balance", "999148.84"], ["id", 30]]

    def sell
      stocksymbol = params[:stocksymbol]
      @portfolio = current_user.portfolios.find_by(:stock_symbol => stocksymbol)
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."stock_symbol" = $2 LIMIT $3  [["user_id", 30], ["stock_symbol", "mft"], ["LIMIT", 1]]

    def confirm_sell
      stocksymbol = portfolio_params[:stock_symbol]
      @portfolio = current_user.portfolios.find_by(:stock_symbol => stocksymbol)

      ActiveRecord::Base.transaction do
        @portfolio.quantity -= portfolio_params[:quantity].to_d
        added_amount = @portfolio.access_quote.latest_price * portfolio_params[:quantity].to_d

        if @portfolio.save && @user.update(:balance => @user.balance += added_amount)
          redirect_to portfolios_path, notice: 'Stock was successfully sold.'
          create_transaction_record(false)
          @portfolio.delete_zero_quantity_stock
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = $1 AND "portfolios"."stock_symbol" = $2 LIMIT $3  [["user_id", 30], ["stock_symbol", "mft"], ["LIMIT", 1]]
UPDATE "portfolios" SET "quantity" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["quantity", "0.0"], ["updated_at", "2022-09-12 11:01:17.963230"], ["id", 4]]
UPDATE "users" SET "updated_at" = $1, "balance" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-12 11:01:17.995648"], ["balance", "996600.46"], ["id", 30]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 4]]

    def create_transaction_record(transaction_type)
      current_user.transactions.create(
        :stock_symbol => @portfolio.stock_symbol,
        :transaction_type => transaction_type,
        :order_quantity => portfolio_params[:quantity].to_d,
        :buying_price => @portfolio.access_quote.latest_price,
        :amount => portfolio_params[:quantity].to_d * @portfolio.access_quote.latest_price
      )
---
INSERT INTO "transactions" ("stock_symbol", "transaction_type", "buying_price", "order_quantity", "amount", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"