app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
  def index
    client = IEX::Api::Client.new(
      publishable_token: "pk_b3ce259e9e674fef8588c3da61ef3bf8",
      secret_token: 'sk_0316d9022ff64b7fa63b2f194df3559e',
      endpoint: 'https://cloud.iexapis.com/v1'
  )
    @stocks = Stock.all

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @stock = Stock.find(params[:id])