app/controllers/trader_transactions_controller.rb

  def index
    @transactions = current_user.transactions.order(created_at: "DESC")
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = $1 ORDER BY "transactions"."created_at" DESC  [["user_id", 30]]