app/controllers/transactions_controller.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."created_at" BETWEEN $1 AND $2 ORDER BY "transactions"."id" DESC  [["created_at", "2022-09-08 00:00:00"], ["created_at", "2022-09-08 23:59:59.999999"]]
---
  def index
    @all_transactions = Transaction.all.order(created_at: "DESC")