app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "trader"]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1 AND "users"."role" = $2 AND "users"."state" = $3  [["role", 0], ["role", 0], ["state", "Approved"]]
---
  def index
    @users = User.where(role: "trader")
    @traders = @users.where(role: "trader", state: "Approved")

UPDATE "users" SET "updated_at" = $1, "confirmation_token" = $2, "confirmation_sent_at" = $3, "unconfirmed_email" = $4 WHERE "users"."id" = $5  [["updated_at", "2022-09-12 18:38:09.065924"], ["confirmation_token", "[FILTERED]"], ["confirmation_sent_at", "2022-09-12 18:38:09.066538"], ["unconfirmed_email", "reds@mail.com"], ["id", 29]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 20]]
---
  def destroy
    @user.destroy!