app/models/portfolio.rb

DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 4]]
---
    def delete_zero_quantity_stock
        if self.quantity == 0
            self.destroy