app/views/transactions/index.html.erb

                            <strong>
                                <%= User.find_by(id: all_transaction.user_id).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]